#encoding: utf-8
namespace :imports do
   
  task :projects => :environment do
    [
      [
        "", 
        [
          ["591101", "โครงการเพื่อความมั่นคงและการพัฒนาด้านบริหารจัดการองค์กรเพื่อความเป็นเลิศ   ", 1600000, "590302"], 
          ["591102", "โครงการร่วมสร้างสรรค์พัฒนาแผนยุทธศาสตร์และแผนปฏิบัติการเพื่อความเป็นเลิศ", 300000, "590303"], 
          ["591103", "โครงการพัฒนาและปรับปรุงกระบวนงานเพื่อความเป็นเลิศ", 500000, "590302"], 
          ["591105", "โครงการสนับสนุนและพัฒนาประสิทธิภาพการปฏิบัติงานของสำนักบริหารและพัฒนาวิชาการ", 34000000, "590303"], 
          ["591106", "โครงการส่งเสริมการพัฒนาระบบประกันคุณภาพการปฏิบัติงานเพื่อมุ่งสู่ความเป็นสากล", 350000, "590303"], 
          ["591107", "โครงการพัฒนาความเป็นเลิศด้านข้อมูลเพื่อสนับสนุนการบริหารวิชาการ", 200000, "590302"], 
          ["591204", "โครงการบำรุงรักษาเทคโนโลยีสารสนเทศระบบงานทะเบียนนักศึกษา", 1250000, "590102"], 
          ["591101-1", "โครงการบำรุงรักษาเครื่องกำเนิดไฟฟ้าสำรอง", 300000, "590302"], 
          ["591101-2", "โครงการปรับปรุงภูมิทัศน์สำนักบริหารและพัฒนาวิชาการ", 600000, "590302"], 
          ["591101-3", "โครงการพัฒนาระบบสารสนเทศเพื่อการบริหารโครงการและการประเมินผลปฏิบัติราชการ", 80000, "590302"], 
          ["591101-4", "โครงการสนับสนุนการพัฒนาสิ่งแวดล้อมความเป็นนานาชาติ ", 50000, "590302"], 
          ["591101-5", "โครงการปรับปรุงและพัฒนากระบวนงานตามสายงานเพื่อการจัดโครงสร้างของสำนักฯ", 300000, "590302"], 
          ["591101-6", "โครงการสนับสนุนด้านการบริหารสู่ความเป็นเลิศตามนโยบายผู้บริหาร", 270000, "590302"], 
          ["591103-1", "โครงการอบรมเชิงปฏิบัติการด้านปรับปรุงกระบวนการทำงานใหม่", 10000, "590302"], 
          ["591103-2", "โครงการบริหารจัดการข้อร้องเรียนและรับฟังเสียงลูกค้า", 20000, "590302"], 
          ["591103-3", "โครงการจัดการความรู้ในองค์กร (KM)", 50000, "590302"], 
          ["591103-4", "โครงการศึกษาและวิเคราะห์เพื่อการตัดสินใจด้านการรับบุคคลเข้าศึกษาที่ในมหาวิทยาลัยขอนแก่น", 10000, "590302"], 
          ["591103-5", "การวิเคราะห์ความคุ้มค่าและจุดคุ้มทุนในการใช้งบประมาณที่เกี่ยวกับการจัดสอบ (สทศ.และรับตรง)", 10000, "590302"], 
          ["591103-6", "โครงการสนับสนุนและพัฒนาด้านเทคโนโลยีสารสนเทศเพื่อพัฒนาและปรับปรุงกระบวนงานระยะที่ 1", 400000, "590302"], 
          ["591105-1", "โครงการศึกษาดูงานสำนักบริหารและพัฒนาวิชาการ", 800000, "590303"], 
          ["591105-2", "โครงการสนับสนุนและพัฒนาขีดความสามารถของบุคลากร ", 600000, "590303"], 
          ["591105-2-1", "การฝึกอบรมภาษาอังกฤษ", 200000, "590303"], 
          ["591105-2-2", "การฝึกอบรมที่เกี่ยวข้องกับงาน และส่งเสริมการแลกเปลี่ยนการปฏิบัติงานของบุคลากร", 400000, "590303"], 
          ["591105-3", "โครงการพัฒนาทีมงานคุณภาพ (ทีม + เสริมสร้างสุขภาวะ)", 400000, "590303"], 
          ["591105-4", "โครงการส่งเสริมคุณธรรมจริยธรรม (พัฒนาจิต/จรรยาบรรณ)", 50000, "590302"], 
          ["591105-5", "โครงการสถาปนาสำนักบริหารและพัฒนาวิชาการ", 50000, "590302"], 
          ["591105-6", "โครงการสนับสนุนนโยบายผู้บริหารฯ ", 1500000, "590302"], 
          ["592101", "โครงการประเมินและติดตามการดำเนินงานตามกรอบ TQF (เพื่อสนับสนุนการประกันคุณภาพระดับหลักสูตร)", 100000, "590302"], 
          ["592104", "โครงการร่วมและสนับสนุนการจัดงานพิธีพระราชทานปริญญาบัตร มข.", 7000000, "590302"], 
          ["592105", "โครงการร่วมและสนับสนุนการจัดงานพิธีพระราชทานปริญญาบัตร สถาบันสมทบ", 300000, "590302"], 
          ["592108", "โครงการส่งเสริมและพัฒนาเครือข่ายระบบทะเบียนและสนับสนุนวิชาการ", 400000, "590302"], 
          ["592109", "โครงการดำเนินการรับสมัครและจัดสอบคัดเลือกบุคคลเข้าศึกษาฯ โดยวิธีรับตรง", 20000000, "590302"], 
          ["592202", "โครงการสนับสนุนเพื่อสร้างต้นแบบการดำเนินงานตามกรอบ TQF เชิงคุณภาพ", 200000, "590302"], 
          ["592206", "โครงการสนับสนุนขั้นพื้นฐานด้านงานทะเบียนสำหรับนักศึกษาและอาจารย์", 400000, "590303"], 
          ["592207", "โครงการผลิตบัตรนักศึกษาใหม่ ", 500000, "590302"], 
          ["592210", "โครงการประชาสัมพันธ์และตลาดเชิงรุก ", 1250000, "590302"], 
          ["592109-1", "ดำเนินการเกี่ยวกับการรับบุคคลเข้าศึกษาฯโดยวิธีรับตรงจำนวน 2 รอบ", nil, "590302"], 
          ["592109-2", "โครงการ มข.ก่อการรู้สู่คุณครูแนะแนวฯ (3 วัน 2 คืน จำนวน 200 คน ระยะที่ 1)", nil, "590302"], 
          ["592210-1", "โครงการจัดนิทรรศการตลาดนัดหลักสูตรอุดมศึกษา ครั้งที่ 20", 700000, "590302"], 
          ["592210-2", "โครงการจัดทำสื่อประชาสัมพันธ์มหาวิทยาลัยขอนแก่น", 300000, "590302"], 
          ["592210-3", "สนับสนุนการเข้าร่วมจัดนิทรรศการตลาดนัดหลักสูตรอุดมศึกษา ที่มหาวิทยาลัยอื่นเป็นเจ้าภาพ", 250000, "590302"]
        ]
      ]
    ].each do |datax|
      
      budget_group = BudgetGroup.where(["name = ?", datax[0]]).first
      
      datax[1].each do |data|
        
        policy = Policy.where(["code = ?", data[3].to_s.strip]).first
        
        parent_project_codes = data[0].strip.include?("-") ? data[0].strip.split("-") : []
        parent_project_code = parent_project_codes.size > 0 ? parent_project_codes[0, parent_project_codes.size - 1].join("-") : ""
        
        parent_project = parent_project_code.blank? ? nil : Project.where(["code = ?", parent_project_code]).first
        
        project = Project.where(["code = ?", data[0].strip]).first
        project = Project.new if project.nil?
        project.project_id      = parent_project ? parent_project.id : nil
        project.policy_id       = policy ? policy.id : nil
        project.code            = data[0].strip
        project.name            = data[1].strip
        project.budget_amount   = data[2]
        project.budget_group_id = budget_group ? budget_group.id : nil
        project.workflow_state  = :enabled
        if project.save
          puts "SAVED : #{project.code} #{project.project ? project.project.code : ""}"
        else
          puts "ERROR : #{project.code}"
        end
        
      end
        
    end
    
  end
end