# encoding: utf-8
namespace :utils do
  
  task :init => :environment do
    
    if Evaluation.where(["1 = 1"]).size == 0
      Evaluation.new(
        year: 2550, 
        episode: 1, 
        workflow_state: :enabled
      ).save(validate: false)
    end
    
    # Rake::Task['utils:capacities'].invoke
    # Rake::Task['utils:position_types'].invoke
    # Rake::Task['utils:employee_types'].invoke
    # Rake::Task['utils:tasks'].invoke
    # Rake::Task['utils:sections'].invoke
    # Rake::Task['utils:faculties'].invoke
    # Rake::Task['utils:teams'].invoke
    # Rake::Task['utils:positions'].invoke
    # Rake::Task['utils:users'].invoke
    Rake::Task['utils:policies'].invoke
    Rake::Task['utils:budget_types'].invoke
    Rake::Task['utils:budget_groups'].invoke
  end
   
  task :capacities => :environment do
    [
      [1, "การมุ่งผลสัมฤทธิ์"],
      [2, "การยึดมั่นในความถูกต้องชอบธรรมและจริยธรรม"],
      [3, "การสั่งสมความเชี่ยวชาญในงานอาชีพ"],
      [4, "ความร่วมแรงร่วมใจ (การทำงานเป็นทีม)"],
      [5, "บริการที่ดี"],
      [6, "การควบคุมตนเอง"],
      [7, "การคิดวิเคราะห์"],
      [8, "การตรวจสอบความถูกต้องตามกระบวนงาน"],
      [9, "การมองภาพองค์รวม"],
      [10, "การวางกลยุทธ์ภาครัฐ"],
      [11, "การสร้างสัมพันธภาพ"],
      [12, "การสอนงานและการมอบหมายงาน"],
      [13, "การสั่งการตามอำนาจหน้าที่"],
      [14, "การสืบเสาะหาข้อมูล"],
      [15, "การใส่ใจและพัฒนาผู้อื่น"],
      [16, "ความคิดสร้างสรรค์ (การดำเนินการเชิงรุก)"],
      [17, "ความผูกพันที่มีต่อส่วนราชการ"],
      [18, "ความมั่นใจในตนเอง"],
      [19, "ความยืดหยุ่นผ่อนปรน"],
      [20, "ความเข้าใจข้อแตกต่างทางวัฒนธรรม"],
      [21, "ความเข้าใจผู้อื่น"],
      [22, "ความเข้าใจองค์กรและระบบราชการ"],
      [23, "วิสัยทัศน์"],
      [24, "ศักยภาพเพื่อนำการปรับเปลี่ยน"],
      [25, "ศิลปะการสื่อสารจูงใจ"],
      [26, "สภาวะผู้นำ"],
      [27, "สุนทรียภาพทางศิลปะ"]
    ].each do |data|
      capacity = Capacity.where(["name = ?", data[1]]).first
      capacity = Capacity.new if capacity.nil?
      capacity.name = data[1]
      capacity.workflow_state = :enabled
      capacity.save
    end
    
  end
  
  task :position_types => :environment do
    [
      [1, "เชี่ยวชาญเฉพาะ"], 
      [2, "ทั่วไป"], 
      [3, "ผู้บริหาร"]
    ].each do |data|
      position_type = PositionType.where(["name = ?", data[1]]).first
      position_type = PositionType.new if position_type.nil?
      position_type.sorting = data[0]
      position_type.name = data[1]
      position_type.workflow_state = :enabled
      position_type.save
    end
    
  end
  
  task :employee_types => :environment do
    [
      [1, "ข้าราชการ"], 
      [2, "พนักงานมหาวิทยาลัย"], 
      [3, "ลูกจ้างชั่วคราว"], 
      [4, "พนักงานราชการ"], 
      [5, "ลูกจ้างประจำ"]
    ].each do |data|
      employee_type = EmployeeType.where(["name = ?", data[1]]).first
      employee_type = EmployeeType.new if employee_type.nil?
      employee_type.sorting = data[0]
      employee_type.name = data[1]
      employee_type.workflow_state = :enabled
      employee_type.save
    end
  
  end
  
  task :tasks => :environment do  
    [
      [1, "งานตามแผนยุทธศาสตร์"], 
      [2, "งานประจำ"], 
      [3, "งานเชิงพัฒนา"], 
      [4, "ภาระงานรอง"], 
      [5, "ความถูกต้อง"], 
      [6, "การตรงต่อเวลา"], 
      [7, "การใช้ทรัพยากร"], 
      [8, "ผลงานตรงตามเป้าหมายหรือวัตถุประสงค์ของหน่วยงาน"]
    ].each do |data|
      task = Task.where(["name = ?", data[1]]).first
      task = Task.new if task.nil?
      task.sorting = data[0]
      task.name = data[1]
      task.workflow_state = :enabled
      task.save
    end
    
  end
  
  task :sections => :environment do
    [
      [1, "จัดการสารสนเทศสาขามนุษยศาสตร์และสังคมศาสตร์"],
      [2, "จัดการสารสนเทศสาขาวิทยาศาสตร์สุขภาพ"],
      [3, "จัดการสารสนเทศสาขาวิทยาศาสตร์และเทคโนโลยี"],
      [4, "พิพิธภัณฑ์และหอจดหมายเหตุ"],
      [5, "สนับสนุนทั่วไป"],
      [6, "ส่งเสริมการเรียนรู้"],
      [7, "กลุ่มแผนสารสนเทศ อาคารสถานที่และยานพาหนะ"],
      [8, "รองผู้อำนวยการฝ่ายบริการวิชาการ"],
      [9, "รองผู้อำนวยการฝ่ายบริหาร"],
      [10, "งานซ่อมและแม่บ้าน"],
    ].each do |data|
      section = Section.where(["name = ?", data[1]]).first
      section = Section.new if section.nil?
      section.name = data[1]
      section.workflow_state = :enabled
      section.save
    end
    
  end
  
  task :faculties => :environment do
    [
      [1, "คณะทันตแพทยศาสตร์"],
      [2, "คณะสัตวแพทย์"],
      [3, "คณะพยาบาลศาสตร์"],
      [4, "คณะแพทยศาสตร์"],
      [5, "คณะศึกษาศาสตร์"],
      [6, "คณะวิศวกรรมศาสตร์"],
      [7, "คณะเทคนิคการแพทย์"],
      [8, "คณะสาธารณสุขศาสตร์"],
      [9, "คณะเกษตรศาสตร์"],
      [10, "คณะเภสัชศาสตร์"],
      [11, "คณะสถาปัตยกรรมศาสตร์"],
    ].each do |data|
      faculty = Faculty.where(["name = ?", data[1]]).first
      faculty = Faculty.new if faculty.nil?
      faculty.name = data[1]
      faculty.workflow_state = :enabled
      faculty.save
    end
    
  end
  
  task :teams => :environment do
    [
      [1, "คณะทำงานจัดชั้นหนังสือขึ้นชั้น สำนักวิทยบริการ"],
      [2, "คณะทำงานพัฒนาทรัพยาการสารสนเทศห้องสมุด (Collection Development Team)"],
      [3, "คณะทำงานบริการพื้นฐาน สำนักวิทยบริการ"],
      [4, "คณะทำงานวิเคราะห์หมวดหมู่และลงรายการหนังสือสำนักวิทยบริการ"],
      [5, "คณะทำงานเตรียมทรัพยากรสารสนเทศก่อนและหลังวิเคราะห์หมวดหมู่และลงรายการบรรณานุกรม"],
      [6, "คณะพัฒนาระบบประกันคุณภาพ สำนักวิทยบริการ"],
      [7, "คณะทำงานจัดทำดัชนีวารสาร สำนักวิทยบริการ"],
    ].each do |data|
      team = Team.where(["name = ?", data[1]]).first
      team = Team.new if team.nil?
      team.name = data[1]
      team.workflow_state = :enabled
      team.save
    end
    
  end
  
  task :positions => :environment do
    [
      [1, "จ.บริหารงานทั่วไป ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [2, "จ.บริหารงานทั่วไป ชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [3, "จ.บริหารงานทั่วไป ปฏิบัติการ", "เชี่ยวชาญเฉพาะ"],
      [4, "จ.บริหารงานทั่วไป เชี่ยวชาญ", "เชี่ยวชาญเฉพาะ"],
      [5, "ช่างเทคนิค ชำนาญงานพิเศษ", "ทั่วไป"],
      [6, "ช่างเทคนิค ปฏิบัติงาน", "ทั่วไป"],
      [7, "น.วิชาการเงินและบัญชี ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [8, "น.วิชาการเงินและบัญชี ชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [9, "น.วิชาการเงินและบัญชี ปฏิบัติการ", "เชี่ยวชาญเฉพาะ"],
      [10, "น.วิชาการเงินและบัญชี เชี่ยวชาญ", "เชี่ยวชาญเฉพาะ"],
      [11, "น.วิชาการโสตฯ ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [12, "น.วิชาการโสตฯ ชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [13, "น.วิชาการโสตฯ ปฏิบัติการ", "เชี่ยวชาญเฉพาะ"],
      [14, "น.วิชาการโสตฯ เชี่ยวชาญ", "เชี่ยวชาญเฉพาะ"],
      [15, "น.วิชาการโสตฯ เชี่ยวชาญพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [16, "น.วิเคราะห์นโยบายและแผน (ปก)", "เชี่ยวชาญเฉพาะ"],
      [17, "น.วิเคราะห์นโยบายและแผน ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [18, "ผู้ช่วยผู้อำนวยการฝ่ายแผนและสารสนเทศ", "เชี่ยวชาญเฉพาะ"],
      [19, "น.วิเคราะห์นโยบายและแผน เชี่ยวชาญ", "เชี่ยวชาญเฉพาะ"],
      [20, "หัวหน้ากลุ่มภารกิจสนับสนุนทั่วไป", "เชี่ยวชาญเฉพาะ"],
      [21, "นักจดหมายเหตุ ชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [22, "นักจดหมายเหตุ ปฏิบัติการ", "เชี่ยวชาญเฉพาะ"],
      [23, "นักจดหมายเหตุ เชี่ยวชาญ", "เชี่ยวชาญเฉพาะ"],
      [24, "นักวิชาการคอมพิวเตอร์ ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [25, "นักวิชาการคอมพิวเตอร์ ชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [26, "นักวิชาการคอมพิวเตอร์ ปฏิบัติการ", "เชี่ยวชาญเฉพาะ"],
      [27, "นักวิชาการคอมพิวเตอร์ เชี่ยวชาญ", "เชี่ยวชาญเฉพาะ"],
      [28, "นักวิชาการคอมพิวเตอร์ เชี่ยวชาญพิเศษ", "ทั่วไป"],
      [29, "นักวิชาการพัสดุ ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [30, "นักวิชาการพัสดุ ชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [31, "นักวิชาการพัสดุ ปฏิบัติการ", "เชี่ยวชาญเฉพาะ"],
      [32, "นักวิชาการพัสดุ เชี่ยวชาญ", "เชี่ยวชาญเฉพาะ"],
      [33, "นักสารสนเทศ ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [34, "นักสารสนเทศ ชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [35, "นักสารสนเทศ ปฏิบัติการ", "เชี่ยวชาญเฉพาะ"],
      [36, "นักเอกสารสนเทศ ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [37, "นักเอกสารสนเทศ ชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [38, "นักเอกสารสนเทศ ปฏิบัติการ", "เชี่ยวชาญเฉพาะ"],
      [39, "นักเอกสารสนเทศ เชี่ยวชาญ", "เชี่ยวชาญเฉพาะ"],
      [40, "นักเอกสารสนเทศ เชี่ยวชาญพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [41, "นายช่างเทคนิค ชำนาญงาน", "ทั่วไป"],
      [42, "นายช่างเทคนิค ปฏิบัติงาน", "ทั่วไป"],
      [43, "บรรณารักษ์ ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [44, "บรรณารักษ์ ชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [45, "หัวหน้ากลุ่มภารกิจจัดการสารสนเทศสาขาวิทยาศาสตร์และเทคโนโลยี", "เชี่ยวชาญเฉพาะ"],
      [46, "บรรณารักษ์ ปฏิบัติการ", "เชี่ยวชาญเฉพาะ"],
      [47, "บรรณารักษ์ เชี่ยวชาญ", "เชี่ยวชาญเฉพาะ"],
      [48, "บรรณารักษ์ เชี่ยวชาญพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [49, "บุคลากร ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [50, "บุคลากร ชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ"],
      [51, "บุคลากร ปฏิบัติการ", "เชี่ยวชาญเฉพาะ"],
      [52, "บุคลากร เชี่ยวชาญ", "เชี่ยวชาญเฉพาะ"],
      [53, "ผู้บริหาร เลขานุการสำนักวิทยบริการ", "เชี่ยวชาญเฉพาะ"],
      [54, "ผู้ปฏิบัติงานบริหาร (ชนง.พ)", "ทั่วไป"],
      [55, "ผู้ปฏิบัติงานบริหาร ชำนาญงาน", "ทั่วไป"],
      [56, "ผู้ปฏิบัติงานบริหาร ปฏิบัติงาน", "ทั่วไป"],
      [57, "ผู้ปฏิบัติงานห้องสมุด ชำนาญงาน", "ทั่วไป"],
      [58, "ผู้ปฏิบัติงานห้องสมุด ชำนาญงานพิเศษ", "ทั่วไป"],
      [59, "ผู้ปฏิบัติงานห้องสมุด ปฏิบัติงาน", "ทั่วไป"],
      [60, "พนักงานขับรถยนต์ ปฏิบัติงาน", "เชี่ยวชาญเฉพาะ"],
      [61, "พนักงานห้องสมุด", "ทั่วไป"],
      [62, "พนักงานธุรการ", "ทั่วไป"],
      [63, "พนักงานพัสดุ", "ทั่วไป"],
      [64, "พนักงานฉายภาพยนต์", "ทั่วไป"],
      [65, "แม่บ้าน", "ทั่วไป"],
      [66, "พนักงานพิมพ์", "ทั่วไป"],
      [67, "นักวิชาการพัสดุ ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [68, "ช่างเทคนิค ชำนาญงาน", "ทั่วไป"],
      [69, "นายช่างเทคนิค ชำนาญงานพิเศษ", "ทั่วไป"],
      [70, "รองผู้อำนวยการฝ่ายบริหาร", "เชี่ยวชาญเฉพาะ"],
      [71, "หัวหน้ากลุ่มภารกิจพิพิธภัณฑ์และหอจดหมายเหตุ", "เชี่ยวชาญเฉพาะ"],
      [72, "หัวหน้ากลุ่มภารกิจจัดการสารสนเทศสาขาวิทยาศาสตร์สุขภาพ", "เชี่ยวชาญเฉพาะ"],
      [73, "หัวหน้ากลุ่มภารกิจจัดการสารสนเทศสาขามนุษยศาสตร์และสังคมศาสตร์", "เชี่ยวชาญเฉพาะ"],
      [74, "หัวหน้ากลุ่มภารกิจส่งเสริมการเรียนรู้", "เชี่ยวชาญเฉพาะ"],
      [75, "นักจดหมายเหตุ ชำนาญการ", "เชี่ยวชาญเฉพาะ"],
      [76, "รองผู้อำนวยการฝ่ายแผนและสารสนเทศ", "ผู้บริหาร"],
      [77, "รองผู้อำนวยการฝ่ายบริการวิชาการ", "ผู้บริหาร"],
      [78, "ผู้ช่วยผู้อำนวยการฝ่ายบริหาร", "เชี่ยวชาญเฉพาะ"],
      [79, "ผู้ช่วยผู้อำนวยการฝ่ายบริการวิชาการ", "เชี่ยวชาญเฉพาะ"],
    ].each do |data|
      position_type = PositionType.where(["name = ?", data[2]]).first
      position_type_id = position_type ? position_type.id : nil
      
      position = Position.where(["name = ?", data[1]]).first
      position = Position.new if position.nil?
      position.name = data[1]
      position.position_type_id = position_type_id
      position.workflow_state = :enabled
      position.save
    end
    
  end
  
  task :users => :environment do
    data0 = [
      ["amonruedee", "amonruedee@kku.ac.th", "3409900234511", "นางสาว", "ภารดี", "อนุสุเรนทร์"], 
      ["anopol", "anopol@kku.ac.th", "3400400423180", "นาย", "นิพล", "แอมนนท์"], 
      ["apinwha", "apinwha@kku.ac.th", "3451000210163", "นาย", "อภินันท์", "วะทา"], 
      ["bmaliw", "bmaliw@kku.ac.th", "3410100906959", "นาง", "มลิวรรณ", "เบ้าวัน"], 
      ["charsi", "charsi@kku.ac.th", "3409900038631", "นางสาว", "จารุวรรณ", "สิงห์ศิริ"], 
      ["cholni", "cholni@kku.ac.th", "3119800099275", "นาง", "ชลธิชา", "นิลพุธ"], 
      ["cnetna", "cnetna@kku.ac.th", "3409900057466", "นาง", "เนตรนภา", "เจนเจริญ"], 
      ["foss1th", "foss1th@yahoo.com", "3341700228902", "นาง", "ถนอมศรี", "สารธิมา"], 
      ["haranu", "haranu@kku.ac.th", "", "นางสาว", "อรนุช", "หาทองคำ"], 
      ["hatairat", "hatairat@kku.ac.th", "3401800416424", "นาง", "หทัยรัตน์", "บุณยรัตพันธุ์ เงินทอง"], 
      ["jeerge", "jeerge@kku.ac.th", "1440390004841", "นาย", "จีรศักดิ์", "เกษจันทร์"], 
      ["jotapa2", "jotapa2@hotmail.com", "3451000210139", "นาย", "ชัยณรงค์", "อัตภูมิ"], 
      ["jrutai", "jrutai@kku.ac.th", "3420800169230", "นาง", "ฤทัยรัตน์", "เจษฎากุลทวี"], 
      ["junppi", "junppi@kku.ac.th", "3400100644130", "นาง", "จันทร์เพ็ญ", "พิลา"], 
      ["kaeg-chaiya", "kaeg-chaiya@hotmail.com", "3520300001932", "นาย", "สุภาพ", "ไชยยา"], 
      ["kchira", "kchira@kku.ac.th", "3400100891414", "นาง", "จิรภา", "ไกยสวน"], 
      ["kritssa", "kritssa@kku.ac.th", "1459900308268", "นาย", "กฤษณพล", "แสงประชุม"], 
      ["ksurap", "ksurap@kku.ac.th", "3400800046171", "นาย", "สุรพล", "โคตรบาล"], 
      ["ksuwaree", "ksuwaree@kku.ac.th", "3430900212501", "นางสาว", "สุวารี", "เขียวคำ"], 
      ["kyodch", "kyodch@kku.ac.th", "3400101020652", "นาย", "ยอดชาย", "แก้วลือ"], 
      ["lsomsi", "lsomsi@kku.ac.th", "3101000363442", "นางสาว", "สมศิริ", "เลียบสวัสดิ์"], 
      ["mansai", "mansai@kku.ac.th", "3411600465863", "นาย", "มานิตย์", "ไสย์ฮาตวงษ์"], 
      ["matrug", "matrug@kku.ac.th", "3300101289873", "นาง", "มัทรี", "วรรณชัย"], 
      ["med_noon", "med_noon@msn.com", "3310700962052", "นาย", "อติศานต์", "ศรีรัตนประพันธ์"], 
      ["mmaneerat", "mmaneerat@kku.ac.th", "3400900311127", "นางสาว", "มณัษนันท์", "มัคคะรม"], 
      ["natttho", "natttho@kku.ac.th", "1330500230086", "นางสาว", "นัฎฐา", "ทองดา"], 
      ["natwadee", "natp@kku.ac.th", "3909900233405", "นางสาว", "ณัฐวดี", "ปทุมบาล"], 
      ["nsupap", "nsupap@kku.ac.th", "3400101203773", "นางสาว", "สุภาภรณ์", "นามมุง"], 
      ["nucpun", "nucpun@kku.ac.th", "34899014097780", "นางสาว", "นุชนาถ", "พันธุราษฎร์"], 
      ["phaeng", "phaeng@kku.ac.th", "3409900638876", "นาย", "แผง", "ขนวน"], 
      ["phaoph", "phaoph@kku.ac.th", "1409900324476", "นางสาว", "เพราพิลาศ", "ภูแสงศรี"], 
      ["piraai", "piraai@kku.ac.th", "1409900316899", "นางสาว", "พีรณัฐ", "เอี่ยมทอง"], 
      ["plysri", "piysri@kku.ac.th", "3460100774262", "นาง", "เจียระไน", "นีล"], 
      ["ppongpichit", "ppongpichit@kku.ac.th", "3400100976582", "นาย", "พงษ์พิชิต", "พลศรี"], 
      ["pramoo", "pramoo@kku.ac.th", "3400600271529", "นาย", "ประสิทธิ์", "มูลเพีย"], 
      ["pravin", "pravin@kku.ac.th", "3400101352434", "นาย", "ประวิทย์", "อินณรงค์"], 
      ["pronso", "pronso@kku.ac.th", "2400700018941", "นาง", "ภรณ์ฑิพย์", "วะทา"], 
      ["satchara", "satchara@kku.ac.th", "3440500124346", "นางสาว", "ธัญวลัย", "กฤษณกมล"], 
      ["sboonm", "sboonm@kku.ac.th", "3400101561891", "นาย", "ปุญญพัฒน์", "ศรีแก้ว"], 
      ["schaweewan", "schaweewan@kku.ac.th", "3409900540931", "นาง", "ฉวีวรรณ", "สูงแข็ง"], 
      ["senjun", "senjun@kku.ac.th", "3409900843224", "นาย", "เสนีย์", "จันทร์ลุน"], 
      ["siwakh", "siwakh@kku.ac.th", "3409900621841", "นางสาว", "ศิวพร", "ขอดคำ"], 
      ["sjurairat", "sjurairat@kku.ac.th", "5400400006488", "นาง", "จุไรรัตน์", "ศิริมั่งมูล"], 
      ["somphot", "somthi1@kku.ac.th", "3410401049427", "นาย", "สมโภชน์", "ถิ่นปรุ"], 
      ["ssuwannapa", "ssuwannapa@kku.ac.th", "1409900124451", "นางสาว", "สุวรรณภา", "แสงค้อม"], 
      ["sudthe", "sudthe@kku.ac.th", "3309901551856", "นางสาว", "สุทธิชา", "เห็นกลาง"], 
      ["suniwi", "suniwi@kku.ac.th", "1409900100888", "นางสาว", "สุนิษา", "วิงชุน"], 
      ["suriwi", "suriwi@kku.ac.th", "3451000170471", "นางสาว", "ศุรินทร์ธร", "วิญคาม"], 
      ["surkae", "surkae@kku.ac.th", "3400100053123", "นาย", "สุรศักดิ์ ", "แก้วคำแสน"], 
      ["swin", "swin@kku.ac.th", "3409900109415", "นาย", "วิญญ์", "สาสุนันท์"], 
      ["syupap", "syupap@kku.ac.th", "3400100575146", "นางสาว", "ยุภาภรณ์", "สุปัจชา"], 
      ["thango", "thango@kku.ac.th", "3409900932413", "นาย", "ธเนศ  ", " เงาะเศษ"], 
      ["urawan", "urawan@kku.ac.th", "3409900312318", "นาง", "ธันยาภัทร์", "ขำศิริ"], 
      ["usoont", "suoont@kku.ac.th", "3400100323406", "นาย", "สุนทร", "อุทธา"], 
      ["virado", "virado@kku.ac.th", "3409900530536", "นาย", "วิรัช", "ดวงทาแสง"], 
      ["viroj", "viroj@kku.ac.th", "3400100714421", "นาย", "วิโรจน์", "รีสี"]
    ].each do |data|
      
      pid = data[2]
      prefix = data[3].to_s.strip
      firstname = data[4].to_s.strip
      lastname = data[5].to_s.strip

      username = data[0].to_s.strip
      email = data[1].to_s.strip
      
      user = User.where(["pid = ?", pid]).first
      user = User.new if user.nil?
      user.username = username
      user.email = email
      user.pid = pid
      user.prefix = prefix
      user.firstname = firstname
      user.lastname = lastname
      user.password = "%13d" % pid.to_i
      user.password_confirmation = "%13d" % pid.to_i
      user.workflow_state = :enabled
      if user.save
        
      else
        puts user.errors.messages.inspect
      end
    end
    
  end
  
  task :policies => :environment do
    [
      ["5901", "1) นโยบายทั่วไป", nil], 
      ["590101", "1.1 สอดคล้องกับนโยบายงบประมาณ ประจำปีงบประมาณ พ.ศ.2559 และนโยบายลักษณะแบบบูรณาการ ทั้งมิตินโยบายสำคัญของรัฐบาลและมิติของพื้นที่ คือ (1) การเตรียมความพร้อมประเทศไทยในการเข้าสู่ประชาคมอาเซียน (2) การส่งเสริมวิสาหกิจขนาดกลางและขนาดย่อม(3) การพัฒนาระบบบริหารจัดการขนส่งสินค้าและบริการของประเทศ (4) การบูรณาการเขตพัฒนาเศรษฐกิจพิเศษ (5) การขับเคลื่อนการแก้ไขปัญหาจังหวัดชายแดนภาคใต้ (6) การจัดการปัญหาแรงงานต่างด้าวและการค้ามนุษย์ (7) การบริหารจัดการทรัพยากรน้ำ (8) การส่งเสริมการวิจัยและพัฒนา (9) การสร้างรายได้จากการท่องเที่ยวและบริการ (10) การสร้างความปรองดอง (11) การพัฒนาคนตลอดช่วงชีวิต (12) การป้องกัน ปราบปราม และบำบัดรักษาผู้ติดยาเสพติด (13) การฟื้นฟู ป้องกัน และจัดการภัยพิบัติ (14) การบริหารจัดการขยะและสิ่งแวดล้อม (15) การป้องกัน ปราบปรามการทุจริตและประพฤติมิชอบในภาครัฐ (16) การพัฒนาและเพิ่มประสิทธิภาพการใช้พลังงานอย่างยั่งยืน (17) การรักษาความมั่นคงของฐานทรัพยากรธรรมชาติและแก้ปัญหาที่ดินทำกิน (18) การจัดระเบียบการค้าในที่สาธารณะ", "5901"], 
      ["590102", "1.2 สนับสนุนวิสัยทัศน์ พันธกิจ ยุทธศาสตร์ และนโยบาย การบริหารและพัฒนามหาวิทยาลัย (พ.ศ.2558-2562) ตามประกาศมหาวิทยาลัยขอนแก่น ฉบับที่ 6/2557 ลงวันที่ 2 กรกฎาคม 2557", "5901"], 
      ["590103", "1.3 ให้ความสำคัญกับนโยบายสภามหาวิทยาลัยขอนแก่น 4 เสาหลักยุทธศาสตร์ ตามประกาศสภามหาวิทยาลัยขอนแก่น ฉบับที่ 6/2557 ลงวันที่ 2 กรกฎาคม 2557", "5901"], 
      ["5902", "2) นโยบายงบประมาณแผ่นดิน", nil], 
      ["590201", "2.1 สนับสนุนผลผลิต/โครงการ/กิจกรรม ที่สอดคล้องกับนโยบาย/ยุทธศาสตร์การจัดสรรงบประมาณรายจ่ายประจำปีงบประมาณ พ.ศ.2559 ", "5902"], 
      ["590202", "2.2 ให้ความสำคัญกับการพัฒนาคุณภาพการเรียนการสอน เพื่อส่งเสริมความเป็นเลิศในการผลิตบัณฑิต การเสริมสร้างความเข้มแข็งด้านการวิจัย ", "5902"], 
      ["590203", "2.3 ให้ความสำคัญกับการเตรียมความพร้อมสู่ประชาคมอาเซียนและความเป็นนานาชาติ", "5902"], 
      ["590204", "2.4 ให้ความสำคัญกับการตั้งศูนย์กลางบริการสุขภาพชั้นเลิศ (Medical Hub) ของภาคตะวันออกเฉียงเหนือและอนุภูมิภาคลุ่มน้ำโขง (พ.ศ.2558-2561) ", "5902"], 
      ["590205", "2.5 ให้ความสำคัญกับโครงการแก้ไขปัญหาสาธารณสุขและการศึกษาในภาคตะวันออกเฉียงเหนือเพื่อลดความเหลื่อมล้ำทางสังคม", "5902"], 
      ["590206", "2.6 ส่งเสริมการวิจัยและพัฒนา การพัฒนาคนตลอดช่วงชีวิต การป้องกัน ปราบปรามการทุจริตและประพฤติมิชอบในภาครัฐ การสร้างความปรองดอง การส่งเสริมคุณธรรม และจริยธรรมของบุคลากรและนักศึกษา", "5902"], 
      ["5903", "3) นโยบายงบประมาณเงินรายได้", nil], 
      ["590301", "3.1 สนับสนุนการปรับปรุง ซ่อมแซม บำรุงรักษาโครงสร้างพื้นฐาน การปรับปรุงภูมิทัศน์ สิ่งแวดล้อม ด้านความปลอดภัย ส่งเสริมสุขภาวะ ตลอดจนการปรับปรุงระบบขนส่งมวลชน ", "5903"], 
      ["590302", "3.2 สนับสนุน ส่งเสริม การผลิตบัณฑิต การวิจัย การบริการรักษาพยาบาล การบริการวิชาการ การทำนุบำรุงศิลปวัฒนธรรม และการใช้องค์ความรู้จากการเรียนการสอนการวิจัยเพื่อแก้ไขปัญหาในพื้นที่อย่างมีส่วนร่วมกับประชาคมต่างๆ", "5903"], 
      ["590303", "3.3 สนับสนุนการเสาะแสวงหาอาจารย์เพื่อมาบรรจุใหม่ และส่งเสริมการพัฒนาอาจารย์ บุคลากร เพื่อเพิ่มสมรรถนะ ศักยภาพ ให้ปฏิบัติพันธกิจของมหาวิทยาลัยให้ได้ตามมาตรฐานสากล รองรับความเป็นนานาชาติและประชาคมอาเซียน", "5903"], 
      ["590304", "3.4 ส่งเสริม และสนับสนุนทุนนักศึกษา การพัฒนานักศึกษา ให้เป็นบัณฑิตที่พึงประสงค์ สอดคล้องกับการพัฒนาสังคม ประเทศ และรองรับประชาคมอาเซียน ", "5903"], 
      ["590305", "3.5 ส่งเสริมความเป็นเลิศทางด้านการวิจัย และพัฒนาสู่ความเป็นนานาชาติ", "5903"], 
      ["590306", "3.6 ส่งเสริมมาตรการประหยัดพลังงาน การใช้ทรัพยากรอย่างคุ้มค่าและการใช้ประโยชน์ร่วมกัน", "5903"], 
      ["590307", "3.7 สนับสนุนโครงการกิจกรรมที่สร้างรายได้และผลตอบแทนที่เหมาะสมทั้งในระยะสั้นและระยะยาว ", "5903"], 
      ["590308", "3.8 สนับสนุน การสร้างความร่วมมือกับต่างประเทศเพื่อเชื่อมโยงกับทุกภารกิจของมหาวิทยาลัยในทุกๆด้าน ", "5903"]
    ].each do |data|
      
      parent = Policy.where(["code = ?", data[2]]).first
      parent_id = parent ? parent.id : nil
      
      policy = Policy.where(["code = ?", data[0]]).first
      policy = Policy.new if policy.nil?
      policy.policy_id = parent_id
      policy.code = data[0].to_s.strip
      policy.name = data[1].to_s.strip
      policy.workflow_state = :enabled
      policy.save
    end
  end
  
  task :budget_types => :environment do
    [
      ["ตอบแทน"], 
      ["ใช้สอย"], 
      ["วัสดุ"] 
    ].each do |data|
      budget_type = BudgetType.where(["name = ?", data[0]]).first
      budget_type = BudgetType.new if budget_type.nil?
      budget_type.name = data[0].to_s.strip
      budget_type.workflow_state = :enabled
      budget_type.save
    end
  end
  
  task :budget_groups => :environment do
    [
      ["งบเงินอุดหนุน (เงินผลประโยชน์ของสำนักฯ)"], 
      ["งบอุดหนุนทั่วไป (เงินสนับสนุนจากมหาวิทยาลัย)"] 
    ].each do |data|
      budget_group = BudgetGroup.where(["name = ?", data[0]]).first
      budget_group = BudgetGroup.new if budget_group.nil?
      budget_group.name = data[0].to_s.strip
      budget_group.workflow_state = :enabled
      budget_group.save
    end
  end
  
  task :positionx => :environment do
    [
      ["นักวิชาการศึกษาชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ", "ชำนาญการพิเศษ"], 
      ["นักวิชาการศึกษาชำนาญการพิเศษ", "เชี่ยวชาญเฉพาะ", "ชำนาญการพิเศษ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการเงินและบัญชีชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการสถิติชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["นักวิชาการศึกษาชำนาญการ", "เชี่ยวชาญเฉพาะ", "ชำนาญการ"], 
      ["ผู้ปฏิบัติงานบริหาร", "ปฏิบัติงานทั่วไป", "ชำนาญงาน"], 
      ["นักวิชาการโสตทัศนศึกษา", "ปฏิบัติงานเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการคอมพิวเตอร์ชำนญการ", "วิชาชีพเฉพาะ", "ชำนาญการ"], 
      ["นักสารสนเทศ", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["เจ้าหน้าที่บริหารงานทั่วไป", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการพัสดุ", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักสารสนเทศ", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["เจ้าหน้าที่บริหารงานทั่วไป", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิเคราะห์นโยบายและแผน", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการศึกษา", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการศึกษา", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["เจ้าหน้าที่บริหารงานทั่วไป", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการศึกษา", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการศึกษา", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการศึกษา", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการศึกษา", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["เจ้าหน้าที่บริหารงานทั่วไป", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการเงินและบัญชี", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการศึกษา ", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการโสตทัศนศึกษา", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการคอมพิวเตอร์", "วิชาชีพเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการพัสดุ", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักบัญชี", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการศึกษา ", "เชี่ยวชาญเฉพาะ", "ปฏิบัติการ"], 
      ["นักวิชาการคอมพิวเตอร์", "วิชาชีพเฉพาะ", "ปฏิบัติการ"], 
      ["พนักงานพิมพ์ระดับ 3", "กลุ่มงานสนับสนุน", "ส 3"], 
      ["พนักงานธุรการ", "กลุ่มงานสนับสนุน", "ส 3"], 
      ["พนักงานการเงินและบัญชี", "กลุ่มงานบริการ", "-"], 
      ["พนักงานธุรการ", "กลุ่มงานบริการ", "-"], 
      ["นักวิชาการศึกษา", "-", "-"], 
      ["เจ้าหน้าที่บริหารงานทั่วไป", "-", "-"], 
      ["นักวิชาการศึกษา", "-", "-"], 
      ["นักวิชาการศึกษา", "-", "-"], 
      ["เจ้าหน้าที่บริหารงานทั่วไป", "-", "-"], 
      ["นักวิชาการศึกษา", "-", "-"], 
      ["พนักงานธุรการ", "-", "-"], 
      ["พนักงานขับรถยนต์", "-", "-"], 
      ["พนักงานขับรถยนต์", "-", "-"], 
      ["คนงาน", "-", "-"]
    ].each do |data|
      
      position_level = PositionLevel.where(["name = ?", data[2].to_s.strip]).first
      position_level = PositionLevel.new if position_level.nil?
      position_level.name = data[2].to_s.strip
      position_level.workflow_state = :enabled
      position_level.save
      
      position_type = PositionType.where(["name = ?", data[1].to_s.strip]).first
      position_type = PositionType.new if position_type.nil?
      position_type.name = data[1].to_s.strip
      position_type.workflow_state = :enabled
      position_type.save
      
      position = Position.where(["name = ? AND position_level_id = ? AND position_type_id = ?", data[0].to_s.strip, position_level.id, position_type.id]).first
      position = Position.new if position.nil?
      position.name = data[0].to_s.strip
      position.position_level_id = position_level.id
      position.position_type_id = position_type.id
      position.workflow_state = :enabled
      if position.save
      else
        puts position.errors.messages
      end
      
    end
  end
   
end